loom.org
#+TITLE: QuickSilver Loom: Maak One
#+AUTHOR: Mètsàtron — Sovereign Weaver
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Maak control plane (Scheme, XDG-friendly)
#+BEGIN_SRC scheme :tangle all/.config/maak/maak.scm :mkdirp yes
(use-modules (srfi srfi-1)
             (srfi srfi-13)        ; string-prefix?, string-contains
             (ice-9 popen) (ice-9 rdelim) (ice-9 match) (ice-9 pretty-print))

;; Run one shell string via bash -lc <cmd>, print stdout, return exit code.
(define (sh cmd)
  (let* ((p   (open-pipe* OPEN_READ "bash" "-lc" cmd))
         (out (read-string p))
         (ec  (close-pipe p)))
    (display out)
    ec))

(define (ok? code) (zero? code))
(define (task name desc thunk) (list name desc thunk))
(define (task-name t)  (list-ref t 0))
(define (task-desc t)  (list-ref t 1))
(define (task-thunk t) (list-ref t 2))

(define HOME (or (getenv "HOME") (error "HOME not set")))
(define CORE-PROFILE (string-append HOME "/.guix-extra-profiles/core/core"))

(define (mk-guix cmd) (sh (string-append "make -f " HOME "/.dotfiles/all/.mk/guix.mk " cmd)))
(define (mk-guix-root cmd) (sh (string-append "make -f " (getenv "HOME") "/.dotfiles/all/.mk/guix-root.mk " cmd)))
(define (mk cmd) (sh (string-append "make -f " HOME "/.dotfiles/all/.mk/flatpak.mk " cmd)))
(define (mk-appimage cmd)
(let* ((HOME (or (getenv "HOME") ""))
(mk (string-append "make -f " HOME "/.dotfiles/all/.mk/appimage.mk " cmd)))
(let* ((p (open-pipe* OPEN_READ "bash" "-lc" mk))
(out (read-string p))
(ec (close-pipe p)))
(display out) ec)))

(define (with-core thunk)
  (let* ((cmd (string-append ". \"" CORE-PROFILE "/etc/profile\"; " (thunk))))
    (sh cmd)))

(define (usage)
  (display "Usage: loom <task>\nTry: loom list  or  loom --help\n"))

;; Safety: ensure task constructor is always bound at top level
(define task
  (lambda (name desc thunk)
    (list name desc thunk)))

(define tasks
  (list
   (task 'list "List available tasks"
         (lambda ()
           (for-each (lambda (t) (format #t "~a\t~a~%" (task-name t) (task-desc t))) tasks)
           0))
   (task 'all "TOC → tangle → ensure Guix dirs" (lambda () (sh "make all")))
   (task 'stow "Safe stow (backup real files, then stow)" (lambda () (sh "make safe-stow")))
   (task 'health "Show registrar, GTK module, and nvim path"
         (lambda ()
           (sh "pgrep -af appmenu-registrar || echo 'registrar: (none)'")
           (sh "printf 'GTK_MODULES=%s\\n' \"${GTK_MODULES:-}\"")
           (with-core (lambda () "command -v nvim; nvim --version | sed -n '1,2p'"))
             0))
   ;; PULL (does NOT bench)
   (task 'guix:pull "guix pull (update channels)" (lambda () (mk-guix "guix-pull")))
   (task 'guix:apply "Build core+dev profiles"
         (lambda () (sh "make guix-core guix-dev guix-nonguix")))
   (task 'guix:git-bench "Probe guix channel mirrors and print the fastest URL (writes cache)"
         (lambda () (sh "make -f ~/.dotfiles/all/.mk/guix.mk guix-pull-bench")))
   ;; PULL apply: use cached mirror only (or arg passed through)
   (task 'guix:git-apply "Apply fastest guix pull mirror to ~/.config/guix/channels.scm"
         (lambda () (sh "~/.dotfiles/all/.local/bin/guix-apply-pull-url")))
   (task 'guix:dirs "Ensure ancillary Guix directories" (lambda () (mk-guix "guix-dirs")))
   ;; (task 'guix:core "Build core profile from manifest" (lambda () (mk-guix "guix-core")))
   ;; (task 'guix:dev "Build dev profile (depends on core)" (lambda () (mk-guix "guix-dev")))
   ;; (task 'guix:nonguix "Build Nonguix profile from manifest" (lambda () (mk-guix "guix-nonguix")))
   (task 'guix:gc "Collect unreferenced store items (reclaim disk space; safe)"
         (lambda () (mk-guix "guix-gc")))
   ;; Substitutes: bench+apply (never run on list/all)
   (task 'guix:sub-bench "Benchmark Guix substitute servers and print best order"
         (lambda () (sh "make -f ~/.dotfiles/all/.mk/guix-substitutes.mk guix-sub-bench")))
   (task 'guix:sub-apply "Apply the best substitute server order to guix-daemon"
         (lambda () (sh "make -f ~/.dotfiles/all/.mk/guix-substitutes.mk guix-sub-apply")))
   (task 'which-nvim "Show nvim location and version"
         (lambda () (with-core (lambda () "command -v nvim; nvim --version | sed -n '1,2p'"))
           0))
   (task 'which-zsh "Show nvim location and version"
         (lambda () (with-core (lambda () "command -v zsh; zsh --version | sed -n '1,2p'"))
           0))
   ;; (task 'inkscape-timecapsule "Hint for running Inkscape from a past generation" (lambda () (sh "guix describe --generations; echo 'Usage: guix time-machine --generation=N -- shell --pure inkscape -- inkscape'") 0))
   (task 'root:sync "Sync dotfiles configs into root (channels, manifest, nvim)"
         (lambda () (sh "~/.dotfiles/all/.local/bin/root-sync")))

   (task 'guix:pull-root "guix pull for root using synced channels"
         (lambda () (mk-guix-root "guix-root-pull")))
   (task 'guix:root "Apply root manifest to root profile"
         (lambda () (mk-guix-root "guix-root-apply")))
   (task 'guix:gc-root "Collect unreferenced store items for root"
         (lambda () (mk-guix-root "guix-root-gc")))
   (task 'root:config "Apply root-level configs that need sudo (Early OOM etc.)"
         (lambda () (sh "MODE=balanced ~/.dotfiles/think/.local/bin/earlyoom-balanced")))
   (task 'root:earlyoom-dryrun "Show what earlyoom would kill, without killing"
         (lambda () (sh "sudo systemctl stop earlyoom && sudo earlyoom --dryrun -m 5,3 -s 15,10 \
        --prefer '^(kdeconnectd|fluidsynth|jellyfin|[Oo]bsidian|Telegram|WebExtensions|qmmp)$' \
        --avoid  '^(floorp|thunar|gvfs.*)$'; sudo systemctl start earlyoom")))
   (task 'root:which-nvim "Show root nvim location and version"
         (lambda () (sh "sudo -i sh -lc 'command -v nvim; nvim --version | sed -n \"1,2p\"'")))
   (task 'flatpak:apply "Enforce exact match (set ENFORCE/UNINSTALL/FO... vars as needed)"
         (lambda () (mk "flatpak-apply")))
   (task 'flatpak:diff "Plan: desired (TSV) vs installed"
         (lambda () (mk "flatpak-diff")))
   (task 'flatpak:bridge "Apply Flatpak fonts/cursors bridge"
         (lambda () (sh "make flatpak-bridge")))
   (task 'flatpak:x11 "Re-stow think/.xsessionrc & friends" (lambda () (sh "make x11-apply")))
   (task 'flatpak:remotes "Ensure remotes (user+system) with clean env"
         (lambda () (mk "flatpak-remotes")))
   ;; (task 'flatpak:capture "Capture live apps → linux/.flatpak/manifest/apps.tsv" (lambda () (mk "flatpak-capture")))
   ;; (task 'flatpak:sync "Additive apply (no removals)" (lambda () (mk "flatpak-sync")))
   (task 'flatpak:perms-capture "Capture per-app permissions/overrides"
         (lambda () (mk "flatpak-perms-capture")))
   (task 'flatpak:perms-apply "Apply captured permissions/overrides"
         (lambda () (mk "flatpak-perms-apply")))
   (task 'snap:sync "Install or refresh everything in the manifest, no removals"
         (lambda () (sh "make -f ~/.dotfiles/all/.mk/snap.mk snap-apply")))
   (task 'snap:apply "Install from manifest, uninstall extras (safe, keeps protected bases)"
         (lambda () (sh "make -f ~/.dotfiles/all/.mk/snap.mk snap-enforce")))
   (task 'snap:apply! "Install from manifest, uninstall extras, allow protected removals"
         (lambda () (sh "make -f ~/.dotfiles/all/.mk/snap.mk snap-enforce-force")))
   ;; (task 'snap:sync-dry "Dry run of sync" (lambda () (sh "make -f ~/.dotfiles/all/.mk/snap.mk snap-apply-dry")))
   (task 'snap:prune "Remove all disabled snap revisions"
         (lambda () (sh "~/.dotfiles/all/.local/bin/snap-prune-disabled")))
   ;; (task 'snap:autoremove-list "Dry run: prune disabled, remove unused content snaps and bases" (lambda () (sh "~/.dotfiles/all/.local/bin/snap-autoremove")))
   (task 'snap:autoremove "Execute: same as above, with removals"
         (lambda () (sh "~/.dotfiles/all/.local/bin/snap-autoremove --yes")))
   (task 'snap:orphans "List orphaned user data dirs under ~/snap"
         (lambda () (sh "make -f ~/.dotfiles/all/.mk/snap.mk snap-list-orphans")))
   ;; (task 'snap:purge-data! "Execute: also purge orphaned data dirs under ~/snap and /var/snap" (lambda () (sh "~/.dotfiles/all/.local/bin/snap-autoremove --yes --purge-data")))
   (task 'snap:connections "Show consumers of common content snaps"
         (lambda () (sh "make -f ~/.dotfiles/all/.mk/snap.mk snap-connections")))
   (task 'snap:capture "Capture installed apps → all/.snap/manifest/apps.tsv"
         (lambda () (sh "~/.dotfiles/all/.local/bin/snap-capture")))
   (task 'snap:diff "Plan: show manifest vs installed"
         (lambda () (sh "~/.dotfiles/all/.local/bin/snap-diff")))
   (task 'appimage:integrate "Install/enable appimaged user service from the newest AppImage"
         (lambda () (sh "~/.local/bin/appimage-integrator-setup")))
   (task 'appimage:update "Update all AppImages (Auto-integrate, scrub desktops)"
         (lambda () (sh "make -f ~/.dotfiles/all/.mk/appimage.mk appimage-update")))
   ;; Back-compat alias
   (task 'appimage:ail-scrub  "Deactivate/clean AIL bits (manual, safe to keep for later)"
         (lambda () (sh "~/.local/bin/appimage-ail-scrub")))
   (task 'appimage:health     "Show appimaged/AIL state and last 50 log lines"
         (lambda () (sh "~/.local/bin/appimage-health")))
   (task 'appimage:inventory "Classify AppImages: supports/manual/dead and write TSVs"
         (lambda () (sh "~/.local/bin/appimage-inventory")))
))

(define (pad-right s width)
  (let ((n (string-length s)))
    (if (>= n width) s (string-append s (make-string (- width n) #\space)))))

(define (task-name-str t) (symbol->string (task-name t)))

(define (print-group title pred)
  (let* ((ts  (filter pred tasks))
         (ts  (sort ts (lambda (a b) (string<? (task-name-str a)
                                               (task-name-str b))))))
    (when (pair? ts)
      (format #t "~a~%" title)
      (for-each
       (lambda (t)
         (let ((nm (pad-right (task-name-str t) 22)))
           (format #t "  ~a ~a~%" nm (task-desc t))))
       ts)
      (newline))))

(define (print-groups)
  (print-group "Main commands"
               (lambda (t) (not (string-contains (task-name-str t) ":"))))
  (print-group "Gnu Guix commands"
               (lambda (t) (string-prefix? "guix:" (task-name-str t))))
  (print-group "Flatpak commands"
               (lambda (t) (string-prefix? "flatpak:" (task-name-str t))))
  (print-group "Snap commands"
               (lambda (t) (string-prefix? "snap:" (task-name-str t))))
  (print-group "AppImage commands"
               (lambda (t) (string-prefix? "appimage:" (task-name-str t)))))

(define (usage)
  (display
"Usage: loom OPTION | COMMAND ARGS...
Run COMMAND with ARGS, if given.

  -h, --help            display this helpful text and exit
  -V, --version         display version information and exit

COMMAND must be one of the sub-commands listed below:

")

  (print-groups))

(define (run name)
  (let ((t (find (lambda (t) (eq? (task-name t) name)) tasks)))
    (if t ((task-thunk t))
        (begin (format #t "Unknown task: ~a\n" name) 1))))

;; --- Help / Version ---
(define (usage)
  (display
"Usage: loom OPTION | COMMAND ARGS...
Run COMMAND with ARGS, if given.

  -h, --help            display this helpful text and exit
  -V, --version         display version information and exit

COMMAND must be one of the sub-commands listed below:

  main commands
    list                List available tasks
    all                 TOC → tangle → ensure Guix dirs
    stow                Safe stow (backup real files, then stow)
    health              Show registrar, GTK module, and nvim path

Tip: run 'loom list' to see everything.
"))

(define (print-version)
  (display "QuickSilver Loom v0.1 (maak control plane)\n"))

;; main: accepts `loom`, `loom -h/--help`, etc.
(define (drop-dashdash xs)
  (cond ((and (pair? xs) (string=? (car xs) "--")) (drop-dashdash (cdr xs)))
        (else xs)))

;; in main
(define (main args)
  (let* ((rest (drop-dashdash (cdr args))))
    (match rest
      (()               (begin (usage) 0))
      (("-h")           (begin (usage) 0))
      (("--help")       (begin (usage) 0))
      (("-V")           (begin (print-version) 0))
      (("--version")    (begin (print-version) 0))
      (("help")         (begin (usage) 0))
      (("list")         (run 'list))
      ((cmd . _more)    (run (string->symbol cmd)))
      (_                (begin (usage) 1)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle all/.local/bin/dotfiles-batch.el :mkdirp yes
;;; dotfiles-batch.el --- Batch helpers for literate dotfiles (root-only) -*- lexical-binding: t -*-

(require 'cl-lib)
(require 'org)
(require 'ob-tangle)
(require 'ox)

;; at top of all/.local/bin/dotfiles-batch.el
(when noninteractive
  (setq create-lockfiles nil
        make-backup-files nil
        auto-save-default nil
        backup-inhibited t
        vc-make-backup-files nil))

;; Batch safety: no backups, no autosave, no lockfiles
(setq make-backup-files nil
      backup-inhibited t
      auto-save-default nil
      create-lockfiles nil
      vc-follow-symlinks t)

;; Disable tangle comment fences by default for common langs we emit
(defun lc/set-comments-no (&rest langs)
  (dolist (L langs)
    (let* ((var (intern (format "org-babel-default-header-args:%s" L)))
           (alist (when (boundp var) (symbol-value var))))
      (set var (cons (cons :comments "no")
                     (assq-delete-all :comments (or alist '())))))))
(lc/set-comments-no 'yaml 'json 'css 'lua 'python 'sh 'bash 'emacs-lisp)

;;; --- LainCore bootstrap for batch tangling ---
(require 'cl-lib)

;;; --- Laincore bootstrap for dynamic :tangle headers ------------------------

(defun lc/batch-boot-if-needed (&optional root)
  (let* ((root (file-name-as-directory (or root default-directory)))
         (style (expand-file-name "style.org" root))
         (auto  (expand-file-name "all/.local/bin/laincore-autoload.el" root)))
    ;; non-fatal autoload — defines stubs like lc/emit if real boot fails
    (when (file-readable-p auto) (load auto t t))
    (when (and (not (fboundp 'lc/emit))
               (file-readable-p style))
      (require 'org) (require 'ob-emacs-lisp)
      (let ((org-confirm-babel-evaluate nil))
        (with-current-buffer (find-file-noselect style)
          (save-excursion
            (condition-case _ (progn
                                (org-babel-goto-named-src-block "lc-bootstrap")
                                (org-babel-execute-src-block))
              (error nil))
            (condition-case _ (progn
                                (org-babel-goto-named-src-block "lc-activate")
                                (org-babel-execute-src-block))
              (error nil))))))))

(defun lc/s (theme key) (plist-get (alist-get theme lc/syntax-palettes) key))

(defun lc/get (app lane)
  (or (caddr (assoc app (cl-remove-if-not (lambda (x) (eq (cadr x) lane)) lc/overrides)))
      (pcase lane ('ui lc/ui) ('syntax lc/syntax))))

(defvar lc/fonts '(:ui "San Francisco Display 9" :mono "SFMono Nerd Font 10"))
(defun lc/font (lane) (plist-get lc/fonts lane))

(defun lc/emit (_app _lane path) path)
;;; --- end bootstrap ---

;; ---- root-only org list ----------------------------------------------------
(defun dotfiles--root-org-files (root)
  "Return only ROOT/*.org (no recursion, ignore dotfiles and exports)."
  (let* ((abs-root (file-name-as-directory (expand-file-name root)))
         (files (directory-files abs-root t "\\.org\\'")))
    (cl-remove-if
     (lambda (f)
       (or (not (file-regular-p f))
           (string-match-p "/\\." (file-name-nondirectory f))  ; ignore hidden names
           (string-match-p "\\.\\(html\\|md\\)\\'" f)))
     files)))

;; ---- dynamic block: list root org files ------------------------------------
(defun org-dblock-write:dotfiles-index (params)
  "Bullet list of ROOT/*.org as links. Params: :dir, :glob, :exclude"
  (let* ((dir (file-name-as-directory
               (expand-file-name (or (plist-get params :dir) default-directory))))
         (glob (or (plist-get params :glob) "*.org"))
         (exclude-str (or (plist-get params :exclude) ""))
         (exclude (split-string exclude-str "[ ,]+" t))
         (files (directory-files dir t (wildcard-to-regexp glob) t)))
    (setq files (cl-remove-if
                 (lambda (f)
                   (let ((bn (file-name-nondirectory f)))
                     (or (member bn exclude)
                         (not (file-regular-p f))
                         (string-match-p "/\\." bn))))
                 files))
    (let ((orig (point)))
      (insert (mapconcat
               (lambda (f)
                 (format "- [[file:%s][%s]]"
                         (file-relative-name f dir)
                         (file-name-sans-extension (file-name-nondirectory f))))
               files "\n"))
      (when (= orig (point)) (insert "- (no matching files)\n")))))

;; ---- batch entrypoints ------------------------------------------------------
(defun dotfiles-batch-update (root)
  "Update dynamic blocks for ROOT/*.org only."
  (interactive "DRoot: ")
  (dolist (f (dotfiles--root-org-files root))
    (with-current-buffer (find-file-noselect f)
      (org-mode)
      (condition-case _ (org-update-all-dblocks) (error nil))
      (save-buffer)
      (kill-buffer))))

(defun dotfiles-batch-tangle (root)
  "Tangle ROOT/*.org only; if FILE==style.org also run the emitter blocks."
  (interactive "DRoot: ")
  (setq root (file-name-as-directory (expand-file-name root)))
  ;; make lc/* available for dynamic :tangle, then tangle
  (lc/batch-boot-if-needed root)
  (let ((org-confirm-babel-evaluate nil))
    (dolist (f (dotfiles--root-org-files root))
      (message ">> TANGLE %s" f)
      (with-current-buffer (find-file-noselect f)
        (org-mode)
        (org-babel-tangle)
        ;; ALSO run “:tangle no” emitters for style.org
        (when (string= (file-name-nondirectory f) "style.org")
          (dolist (blk '("lc-bootstrap" "lc-activate"
                         "emit-gtk3-settings-ini" "emit-gtk3-css"
                         "emit-xfce4-terminal-theme" "emit-doom-base16-theme"
                         "emit-wezterm-flatpak" "emit-vscodium-theme"
                         "emit-emacs-vterm-ansi"))
            (condition-case _ (progn
                                (org-babel-goto-named-src-block blk)
                                (org-babel-execute-src-block))
              (error nil))))
        (kill-buffer)))))

(provide 'dotfiles-batch)
;;; dotfiles-batch.el ends here
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/loom :shebang "#!/usr/bin/env bash" :mkdirp yes
set -euo pipefail
CONF="${XDG_CONFIG_HOME:-$HOME/.config}/maak/maak.scm"
GUIX_GUILE="$HOME/.guix-extra-profiles/core/core/bin/guile"
export GUILE_AUTO_COMPILE=0
exec "$GUIX_GUILE" -e main -s "$CONF" "$@"
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/org-tangle-one :shebang "#!/usr/bin/env bash" :mkdirp yes
# ~/.local/bin/org-tangle-one
#!/usr/bin/env bash
set -Eeuo pipefail
file="${1:?Usage: org-tangle-one <file.org>}"
echo ">> Tangle $file"

if [[ "$(basename "$file")" == "style.org" ]]; then
  exec emacs --batch -Q \
    --eval "(setq org-confirm-babel-evaluate nil create-lockfiles nil make-backup-files nil auto-save-default nil)" \
    --eval "(require 'org)" \
    --eval "(require 'ob-emacs-lisp)" \
    --eval "(find-file \"$file\")" \
    --eval "(org-babel-goto-named-src-block \"loom-style\")" \
    --eval "(org-babel-execute-src-block)"
else
  exec emacs --batch -Q \
    --eval "(setq org-confirm-babel-evaluate nil create-lockfiles nil make-backup-files nil auto-save-default nil)" \
    --eval "(find-file \"$file\")" \
    --eval "(org-babel-tangle)"
fi
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/org-tangle-laincore :shebang "#!/usr/bin/env bash" :mkdirp yes
# ~/.local/bin/org-tangle-laincore
#!/usr/bin/env bash
set -euo pipefail
emacs --batch -Q \
  --eval '(load-file "~/.local/bin/dotfiles-batch.el")' \
  --eval '(setq org-confirm-babel-evaluate nil)' \
  --eval '(require '"'"'org)' \
  --eval '(require '"'"'ob-emacs-lisp)' \
  --eval '(find-file "style.org")' \
  --eval '(org-babel-goto-named-src-block "loom-style")' \
  --eval '(org-babel-execute-src-block)'
#+END_SRC

** Lint script (fast, loud, opinionated)
#+BEGIN_SRC bash :tangle all/.local/bin/org-style-lint :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

# Behavior:
# - Warn on *lowercase* #+begin_src / #+end_src
# - Do NOT fail the build by default.
# - Set STRICT_LINT=1 if you want warnings to be fatal.

shopt -s nullglob globstar
STATUS=0

# Match lowercase only (exact), not mixed/uppercase.
LOWER_BEGIN_RE='^[[:space:]]*#\+begin_src\b'
LOWER_END_RE='^[[:space:]]*#\+end_src\b'

echo "== org-style-lint =="
while IFS= read -r -d '' f; do
  # Report lowercase begin/end
  if grep -nE "$LOWER_BEGIN_RE|$LOWER_END_RE" "$f" >/dev/null 2>&1; then
    echo "!! Lowercase #+begin_src/#+end_src found (prefer UPPERCASE) → $f"
    grep -nE "$LOWER_BEGIN_RE|$LOWER_END_RE" "$f" || true
    STATUS=1
  fi
done < <(printf '%s\0' **/*.org)

if [ "${STRICT_LINT:-0}" = "1" ] && [ $STATUS -ne 0 ]; then
  exit 1
fi
exit 0
#+END_SRC

* 🛠️ Make Targets
#+BEGIN_SRC makefile :tangle Makefile :padline no :comments none
# -*- mode: makefile-gmake; indent-tabs-mode: t; tab-width: 8 -*-
.RECIPEPREFIX := |

EMACS ?= emacs
SCRIPT = all/.local/bin/dotfiles-batch.el
ROOT   = $(PWD)
GUIX ?= guix
GUIX_HOME := $(HOME)/.config/guix
EXTRA := $(HOME)/.guix-extra-profiles

# Stow packages you normally manage here
STOW_PKGS ?= all linux debian think

.PHONY: toc tangle all guix-pull guix-core guix-dev guix-gc guix-dirs \
        stow safe-stow x11-apply bridge-flatpak bridge-flatpak-reset preview-stow lint

lint:
| all/.local/bin/org-style-lint

# Make tangle depend on lint
tangle: lint

EMACS_BATCH = $(EMACS) --batch -Q \
  --eval "(setq create-lockfiles nil make-backup-files nil auto-save-default nil backup-inhibited t vc-make-backup-files nil)"

toc:
| $(EMACS_BATCH) --eval '(load-file "$(SCRIPT)")' --eval '(dotfiles-batch-update "$(ROOT)")'

tangle:
| $(EMACS_BATCH) --eval '(load-file "$(SCRIPT)")' --eval '(dotfiles-batch-tangle "$(ROOT)")'

# all = toc → tangle → guix-dirs only
all: toc tangle guix-dirs

# Plain stow
stow:
| cd $(HOME)/.dotfiles && stow $(STOW_PKGS)

# Safe stow with timestamped backups of real files
safe-stow:
| set -euo pipefail; \
| cd $(HOME)/.dotfiles; \
| for pkg in $(STOW_PKGS); do \
|   echo ">> preview $$pkg"; \
|   stow -n $$pkg 2>&1 \
|     | sed -n 's/.*\* existing target is neither a link nor a directory: \(.*\)$$/\1/p' \
|     | while read -r t; do \
|         case "$$t" in /*) abs="$$t" ;; *) abs="$(HOME)/$$t" ;; esac; \
|         if [ -e "$$abs" ] && [ ! -L "$$abs" ]; then \
|           ts=$$(date +%Y%m%d-%H%M%S); \
|           echo "   backup $$abs -> $$abs.bak.$$ts"; \
|           cp -a "$$abs" "$$abs.bak.$$ts"; \
|           echo "   remove  $$abs"; \
|           rm -rf "$$abs"; \
|         fi; \
|       done; \
|   echo ">> stow $$pkg"; \
|   stow $$pkg; \
| done

preview-stow:
| cd $(HOME)/.dotfiles && stow -n $(STOW_PKGS) || true

# X11 apply for think overlay
x11-apply: tangle
| cd $(HOME)/.dotfiles && stow think
| @echo "✅ X11 applied."

include $(HOME)/.dotfiles/all/.mk/flatpak.mk
include $(HOME)/.dotfiles/all/.mk/guix.mk
include $(HOME)/.dotfiles/all/.mk/guix-substitutes.mk
include $(HOME)/.dotfiles/all/.mk/snap.mk
include $(HOME)/.dotfiles/all/.mk/appimage.mk
#+END_SRC
